<?php

namespace Database\Seeders;

use App\Models\Option;
use App\Models\Page;
use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Page::create([
            'name' => 'POLICY',
            'content' => '<p>تیم دیکوینکس متشکل از جمعی از دانشجویان دانشگاه شریف وتهران می&zwnj;باشد که در زمینه های گوناگون اعم از برنامه نویسی، &nbsp;ما از نزدیک شاهد برخی مشکلات برای ایرانیان از جمله دسترسی سخت به بازارهای خارجی، وجود کلاهبرداران داخلی، خرید و فروش با سودی ناعادلانه برای مردم توسط صرافی های داخلی و از طرفی جود نداشتن پلتفرمی امن و حرفه ای برای خرید و فروش بیت کوین و سایر ارزهای دیجیتال در ایران و دلایل متعدد دیگر بوده&zwnj;ایم. ما با مشاهده این مشکلات تصمیم به ایجاد پلتفرمی کاملا ایمن، حرفه ای وآسان برای خرید و فروش بیت کوین و سایر ارزهای دیجیتال گرفتیم. امیدواریم که بتوانیم با تلاش بسیار و نوآوری محصولی شایسته شما ارائه نماییم. تیم دیکوینکس متشکل از جمعی از دانشجویان دانشگاه شریف وتهران می&zwnj;باشد که در زمینه های گوناگون اعم از برنامه نویسی، مدیریت و مالی تخصص دارند.افراد این تیم در چندسال اخیر، در خرید و فروش بیت کوین و سایر ارزهای دیجیتال فعال بوده اند. </p>'
        ]);

        Page::create([
            'name' => 'HELP',
            'title' => 'چه روش‌هایی برای معامله در تست وجود دارد؟',
            'content' => 'شما می‌توانید پس از تکمیل و تأیید حساب کاربری و همچنین شارژ حساب خود، با مراجعه به بازار رمزارز موردنظر، به مبادله بپردازید.'
        ]);

        Page::create([
            'name' => 'HELP',
            'title' => 'از کجا شروع کنم؟',
            'content' => 'برای شروع به کار با تست، پیش از هر چیز باید مراحل زیر را تکمیل کنید'
        ]);

        Page::create([
            'name' => 'ABOUT_US',
            'content' => '<p>تیم دیکوینکس متشکل از جمعی از دانشجویان دانشگاه شریف وتهران می&zwnj;باشد که در زمینه های گوناگون اعم از برنامه نویسی، &nbsp;ما از نزدیک شاهد برخی مشکلات برای ایرانیان از جمله دسترسی سخت به بازارهای خارجی، وجود کلاهبرداران داخلی، خرید و فروش با سودی ناعادلانه برای مردم توسط صرافی های داخلی و از طرفی جود نداشتن پلتفرمی امن و حرفه ای برای خرید و فروش بیت کوین و سایر ارزهای دیجیتال در ایران و دلایل متعدد دیگر بوده&zwnj;ایم. ما با مشاهده این مشکلات تصمیم به ایجاد پلتفرمی کاملا ایمن، حرفه ای وآسان برای خرید و فروش بیت کوین و سایر ارزهای دیجیتال گرفتیم. امیدواریم که بتوانیم با تلاش بسیار و نوآوری محصولی شایسته شما ارائه نماییم. تیم دیکوینکس متشکل از جمعی از دانشجویان دانشگاه شریف وتهران می&zwnj;باشد که در زمینه های گوناگون اعم از برنامه نویسی، مدیریت و مالی تخصص دارند.افراد این تیم در چندسال اخیر، در خرید و فروش بیت کوین و سایر ارزهای دیجیتال فعال بوده اند. </p>'
        ]);

        Option::create(
            [
                'section' => 'ADDRESS',
                'option_key' => 'address',
                'option_value' => 'test'
            ]
        );
        Option::create(
            [
                'section' => 'ADDRESS',
                'option_key' => 'phone',
                'option_value' => 'test'
            ]
        );

        Option::create(
            [
                'section' => 'ADDRESS',
                'option_key' => 'email',
                'option_value' => 'test'
            ]
        );

        Option::create(
            [
                'section' => 'SOCIAL',
                'option_key' => 'telegram',
                'option_value' => 'test'
            ]
        );
        Option::create(
            [
                'section' => 'SOCIAL',
                'option_key' => 'twitter',
                'option_value' => 'test'
            ]
        );
        Option::create(
            [
                'section' => 'ADDRESS',
                'option_key' => 'instagram',
                'option_value' => 'test'
            ]
        );

        Option::create(
            [
                'section' => 'ADDRESS',
                'option_key' => 'linkedin',
                'option_value' => 'test'
            ]
        );

        Option::create(
            [
                'section' => 'APP',
                'option_key' => 'android',
                'option_value' => 'test'
            ]
        );

        Option::create(
            [
                'section' => 'APP',
                'option_key' => 'ios',
                'option_value' => 'test'
            ]
        );


    }
}
